In [12]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ad\appdata\local\programs\python\python38\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\ad\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.20.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\ad\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\ad\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\ad\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 20.2.3; however, version 21.0.1 is available.
You should consider upgrading via the 'c:\users\ad\appdata\local\programs\python\python38\python.exe -m pip install --upgrade pip' command.

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame(
{
    "Name": [
        "Braund, Mr. Owen Harris",
        "Allen, Mr. William Henry",
        "Bonnell, Miss. Elizabeth",
    ],
    "Age": [22, 35, 58],
    "Sex": ["male", "male", "female"],
    }
)

In [7]:
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [4]:
se = pd.Series([1,2,3,4],{'서울','대전','대구','부산'})
display(se)

부산    1
서울    2
대전    3
대구    4
dtype: int64

In [5]:
se['서울']

2

In [8]:
se.index

Index(['부산', '서울', '대전', '대구'], dtype='object')

In [9]:
se.values

array([1, 2, 3, 4], dtype=int64)

In [10]:
se.value_counts

<bound method IndexOpsMixin.value_counts of 부산    1
서울    2
대전    3
대구    4
dtype: int64>

In [12]:
sort = sorted(se.values)
display(sort)

[1, 2, 3, 4]

In [13]:
sort = sorted(se.index)
display(sort)

['대구', '대전', '부산', '서울']

In [14]:
se_x = pd.Series([1,2,3,4],{'서울','대전','대구','부산'})
se_y = pd.Series([1,2,3,4],{'서울','대전','대구','부산'})
se_x + se_y

부산    2
서울    4
대전    6
대구    8
dtype: int64

In [15]:
se_x = pd.Series([1,2,3,4],{'서울','대전','대구','부산'})
se_y = pd.Series([1,2,3,4],{'서울','대전','광주','부산'}) #인덱스가 같지 않으면 NaN으로 만듬
se_x + se_y

광주    NaN
대구    NaN
대전    6.0
부산    2.0
서울    4.0
dtype: float64

In [19]:
medal = pd.Series([1,2,3,4,4,1,2,5])
medal.unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [22]:
data = {'alice': [1, 2, 3], 'bob': 20, 'tony': 15, 'suzy': 30,"dodo": [1,3,5,7], "mario": "pitch"}
x = pd.Series(data)
x[2:5]

tony              15
suzy              30
dodo    [1, 3, 5, 7]
dtype: object

### DataFrame

In [24]:
data = {
    'age' : [23, 43, 12, 45],
    'name' : ['민준', '형진', '희석', '석준'],
    'height' : [160, 170, 180, 190]
}
df = pd.DataFrame(data, columns=['age', 'height','name'])

In [25]:
display(df)

   age  height name
0   23     160   민준
1   43     170   형진
2   12     180   희석
3   45     190   석준

In [26]:
display(df['age'])

0    23
1    43
2    12
3    45
Name: age, dtype: int64

In [27]:
display(df.age)

0    23
1    43
2    12
3    45
Name: age, dtype: int64

#### iloc()

In [34]:
ary = pd.DataFrame([[1,2,3],[2,3,4],[3,4,5],[4,5,6]], columns=['first','second','third'])
ary

   first  second  third
0      1       2      3
1      2       3      4
2      3       4      5
3      4       5      6

In [40]:
ary.iloc[1] #1 인덱스 열의 데이터

first     2
second    3
third     4
Name: 1, dtype: int64

In [48]:
ary.iloc[0:1] #0이상 1미만 행의 데이터 [0: 0, x]로 x열의 데이터만 뽑아올수도 있다

   first  second  third
0      1       2      3

In [56]:
data = pd.read_csv("./data/test.csv")
data.head(10)

   id keyword location                                               text
0   0     NaN      NaN                 Just happened a terrible car crash
1   2     NaN      NaN  Heard about #earthquake is different cities, s...
2   3     NaN      NaN  there is a forest fire at spot pond, geese are...
3   9     NaN      NaN           Apocalypse lighting. #Spokane #wildfires
4  11     NaN      NaN      Typhoon Soudelor kills 28 in China and Taiwan
5  12     NaN      NaN                 We're shaking...It's an earthquake
6  21     NaN      NaN  They'd probably still show more life than Arse...
7  22     NaN      NaN                                  Hey! How are you?
8  27     NaN      NaN                                   What a nice hat?
9  29     NaN      NaN                                          Fuck off!

In [57]:
data.tail(10)

,id,keyword,location,text
3253,10838,NaN,NaN,Malaysian PM confirms debris is from missing f...
3254,10845,NaN,NaN,Officials: Alabama home quarantined over possi...
3255,10856,NaN,NaN,See the 16yr old PKK suicide bomber who detona...
3256,10857,NaN,NaN,To conference attendees! The blue line from th...
3257,10858,NaN,NaN,The death toll in a #IS-suicide car bombing on...
3258,10861,NaN,NaN,EARTHQUAKE SAFETY LOS ANGELES ÛÒ SAFETY FASTE...
3259,10865,NaN,NaN,Storm in RI worse than last hurricane. My city...
3260,10868,NaN,NaN,Green Line derailment in Chicago http://t.co/U...
3261,10874,NaN,NaN,MEG issues Hazardous Weather Outlook (HWO) htt...
3262,10875,NaN,NaN,#CityofCalgary has activated its Municipal Eme...

In [59]:
data.head(-10) #밑에서 10번째꺼 까지 전부

,id,keyword,location,text
0,0,NaN,NaN,Just happened a terrible car crash
1,2,NaN,NaN,"Heard about #earthquake is different cities, s..."
2,3,NaN,NaN,"there is a forest fire at spot pond, geese are..."
3,9,NaN,NaN,Apocalypse lighting. #Spokane #wildfires
4,11,NaN,NaN,Typhoon Soudelor kills 28 in China and Taiwan
...,...,...,...,...
3248,10807,wrecked,Acey mountain islanddåÇTorontoåÈ,Smackdown tyme this should put me in a good mo...
3249,10816,wrecked,los angeles,@thrillhho jsyk I haven't stopped thinking abt...
3250,10820,wrecked,"Brussels, Belgium",@stighefootball Begovic has been garbage. He g...
3251,10828,wrecked,NaN,Wrecked today got my hattrick ????
3252,10836,NaN,NaN,#Ebola #EbolaOutbreak Ebola Virus: Birmingham ...

In [60]:
data.tail(-10) #위에서 10번째 까지 빼고 전부

,id,keyword,location,text
10,30,NaN,NaN,No I don't like cold!
11,35,NaN,NaN,NOOOOOOOOO! Don't do that!
12,42,NaN,NaN,No don't tell me that!
13,43,NaN,NaN,What if?!
14,45,NaN,NaN,Awesome!
...,...,...,...,...
3258,10861,NaN,NaN,EARTHQUAKE SAFETY LOS ANGELES ÛÒ SAFETY FASTE...
3259,10865,NaN,NaN,Storm in RI worse than last hurricane. My city...
3260,10868,NaN,NaN,Green Line derailment in Chicago http://t.co/U...
3261,10874,NaN,NaN,MEG issues Hazardous Weather Outlook (HWO) htt...
3262,10875,NaN,NaN,#CityofCalgary has activated its Municipal Eme...